# Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

work_list = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
find_item = 'qwe'
count = 0
if work_list.count(find_item) < 2:
    print(-1)
else:
    for i in range(len(work_list)):
        if work_list[i] == find_item:
            count += 1
            if count == 2:
                print(i)
                break
