# 5. Написать программу вычисления значения функции y = f(a)

def square(x):
    return x**2


a = float(input('Input a: '))
print(f'Square of {a} is {square(a)}.')
